Repository: OGSR/OGSR-Engine
Catalog: _Lua_Extensions и не только/ogsr_configurator/Form1.*.resx
Languages: fr_fr

# ApplyButton.Text
source: Apply
fr_fr: Appliquer

# CloseButton.Text
source: Close
fr_fr: Fermer

# StartGameButton.Text
source: Launch game
fr_fr: Lancer le jeu

# disasm.Text
source: Disassemble shaders
fr_fr: Décompiler les shaders

# disasm.ToolTip
source: Disassemble compiled shaders. Enable this only when the developers tell you to do it.
fr_fr: Décompiler les shaders. Ne le faite que si les développeurs vous le disent.

# noprefetch.Text
source: Disable prefetch
fr_fr: Désactiver "prefetch"

# noprefetch.ToolTip
source: Disable the game from prefetching some of the textures and models during start. It will help to speed up the game loading, but may result in some lags during the game.
fr_fr: Désactive la pré-lecture de textures et de modèles pendant le chargement du jeu. Cela améliore la vitesse de chargement, mais vous risquez d'avoir un peu de ralentissement en jeu.

# dsound.Text
source: Use DirectSound instead of OpenAL sound
fr_fr: Utiliser DirectSound à la place d' OpenAL pour le son

# dsound.ToolTip
source: Use an alternative API for sound playing. Enable this option if sound problems are experienced.
fr_fr: Utilisation d'un autre API pour le son en jeu. À activer si vous rencontrez des problèmes de son en jeu.

# lang_pic_fr.ToolTip
source: Cliquez sur un drapeau pour changer de langue
fr_fr: Français

# lang_pic_en.ToolTip
source: Click here to change the language to English
fr_fr: Click on flag to switch language

# button4.Text
source: Reset weather
fr_fr: Réinitialiser météo

# button4.ToolTip
source: Use this button to reset the weather in case of problems with surge. In this case it's also required to ask for instructions at the OGSE forum.
fr_fr: Use this button to reset weather in case of problems with surge. In this case it's also required to ask instructions on OGSE forum.

# tabPage11.Text
source: Authors
fr_fr: Les auteurs

# tabPage1.Text
source: Features
fr_fr: Caractéristiques et nouveautés

# tabPage10.Text
source: About mod
fr_fr: À propos du mod

# tabPage12.Text
source: Launch options
fr_fr: Options de démarrage

# string_start.Text
source: Final launch string:
fr_fr: Choix du démarrage:

# center_screen.Text
source: Center game window
fr_fr: Plein écran

# ss_tga.Text
source: TGA format for high-res screenshots
fr_fr: Format TGA pour les screenshots en haute résolution

# nointro.Text
source: No start intros
fr_fr: Pas de cinématique d'introduction

# teni.Text
source: Shadow map resolution
fr_fr: Résolution des ombres

# tabPage2.Text
source: Gameplay
fr_fr: Jeu

# tabPage5.Text
source: Graphics
fr_fr: Graphique

# richTextBox2.Text
source: Here you can tune additional parameters of some graphical effects. Main options are available through the game menu (Options -> Video -> Advanced).
fr_fr: Ici vous pouvez régler les paramètres supplémentaires de certains effets graphiques. principale option sont disponibles dans le menu du jeu (Options -> Vidéo -> Avancé)

# tabPage3.Text
source: Update
fr_fr: Mise-à-jour

# label9.Text
source: Download progress
fr_fr: Progression du téléchargement

# button3.Text
source: Install patch
fr_fr: Installer le patch

# label1.Text
source: Installed version:
fr_fr: Version installée:

# label8.Text
source: No updates
fr_fr: Pas de mise-à-jour

# button1.Text
source: Check updates
fr_fr: Vérifier les mises-à-jour

# label5.Text
source: Changelog:
fr_fr: Liste des changements:

# label4.Text
source: Last version:
fr_fr: Dernière version:
