#pragma once
// Для изменения настроек нужно в родительской папке создать папку
// build_config_overrides, скопировать этот файл в нее и изменить, как
// требуется.

// Если функция в precondition диалога не найдена, будем падать, вместо того,
// что бы просто выводить сообщение в лог и игнорировать этот precondition.
//#define CRASH_ON_PRECONDITION_NOT_FOUND

// Убирает возможность назначать альтернативные кнопки. Т.е. убирает второй
// столбец в настройках и отключает консольную команду bind_sec.
#define REMOVE_ALTERNATIVE_KEYBOARD_BINDING

// Включает использование шейдерного кэша
//#define USE_SHADER_CACHE

// Включает скиннинг на кватернионах. Позволяет использовать модели с кол-вом костей до 107.
// Надо будет включить после исправления кривого шейдера skin.h. А пока макс. кол-во костей - 71.
//#define QUATERNION_SKINNING

// Другая реализация равнозначных слотов, из xp-dev. Позволяет задавать список
// допустимых слотов в параметре "slot". Вот так:
//   slot = 2,3
//#define NEW_WPN_SLOTS
