#ifndef ogsr_shaders_cfg
#define ogsr_shaders_cfg

// Если включить, то отражения будут рендериться только на террейне. Так можно съэкономить несколько fps.
//#define REFLECTIONS_ONLY_ON_TERRAIN //Теперь этот макрос управляется консольной командой из движка

// Если включить, то отражения будут рендериться только в самих лужах, а не на всём террейне. Так можно съэкономить ещё несколько fps.
//#define REFLECTIONS_ONLY_ON_PUDDLES //Теперь этот макрос управляется консольной командой из движка

#endif
